# Join the dataframes

In [5]:
import pandas as pd 
from pandasql import sqldf

In [17]:
suburb = pd.read_csv("../data/raw/sub_4_pred.csv")
school = pd.read_csv("../data/raw/dv331_schoollocations2022.csv", encoding='cp1252')
parks = pd.read_csv("../data/curated/suburb_w_leisure.csv")
shop = pd.read_csv("../data/curated/ShoppingCentreData.csv")
train = pd.read_csv("../data/curated/suburbs_w_dstTrain.csv")

In [35]:
parks = parks[["Suburb", "Postcode", "NumPlaygrounds", "NumParks"]]
parks.head()
len(parks)

215

In [12]:
school = school[["School_Name", "Postal_Postcode"]]
school.head()

                              School_Name  Postal_Postcode
0                 Alberton Primary School             3971
1  Allansford and District Primary School             3277
2                    Avoca Primary School             3467
3                   Avenel Primary School             3664
4               Warrandyte Primary School             3113

In [13]:
train = train[["Postcode", "DstToStation"]]
train.head()

   Postcode  DstToStation
0      3182        1444.0
1      3143         307.7
2      3053        1978.0
3      3052        1139.4
4      3182        1444.0

In [24]:
shop = shop[["Shopping Centre Name", "Suburb"]]
shop.head()

                          Shopping Centre Name       Suburb
0                   206 BOURKE STREET Victoria    Melbourne
1        ACLAND COURT SHOPPING CENTRE Victoria     St Kilda
2         ALTONA GATE SHOPPING CENTRE Victoria    Melbourne
3  BALNARRING VILLAGE SHOPPING CENTRE Victoria   Balnarring
4                       BARKLY SQUARE Victoria    Brunswick

In [34]:
# start off with deleting the space in front of suburbs in the shop data
import re
shop["Suburb"] = shop["Suburb"].apply(lambda x: re.sub("^ ", "", x))
query = "SELECT * FROM parks LEFT OUTER JOIN shop ON shop.Suburb = parks.Suburb"
result = sqldf(query)
result

,Suburb,Postcode,NumPlaygrounds,NumParks,Shopping Centre Name,Suburb
0,Aberfeldie,3040,0,0,None,None
1,Albanvale,3021,0,0,None,None
2,Albion,3020,1,0,None,None
3,Alphington,3078,3,0,None,None
4,Altona,3018,0,0,None,None
...,...,...,...,...,...,...
261,Williamstown,3016,4,0,None,None
262,Williamstown North,3016,1,0,None,None
263,Windsor,3181,3,0,None,None
264,Woori Yallock,3139,1,0,None,None
265,Yellingbo,3139,0,0,None,None

In [22]:
school_count = school[["School_Name", "Postal_Postcode"]].groupby(by="Postal_Postcode").count()
school_count

                 School_Name
Postal_Postcode
3000                       4
3003                       1
3004                       4
3006                       2
3008                       1
...                      ...
3987                       1
3988                       1
3992                       1
3995                       6
3996                       2

[581 rows x 1 columns]

In [20]:
merge = school_count.merge(suburb, right_on="Postal_Postcode", left_on="Postcode")

AttributeError: 'Series' object has no attribute 'merge'